Repository: 0x2b3bfa0/guix
Catalog: po/guix/*.po
Languages: eo

source: ~a: patch not found
eo: ~a: flikaĵo ne trovita

source: could not find bootstrap binary '~a' for system '~a'
eo: ne eblis trovi ekŝargilan ciferec-dosieron '~a' por la sistemo '~a'

source: cannot access `~a': ~a~%
eo: ne eblas atingi '~a': ~a~%

source: looking for the latest release of GNU ~a...
eo: ni serĉas la lastan eldonon de GNU ~a...

source: ~a: note: using ~a but ~a is available upstream~%
eo: ~a: rimarko: ni uzas ~a sed ~a disponeblas unuanivele~%

source: ambiguous package specification `~a'~%
eo: plursenca pak-specifigo '~a'~%

source: choosing ~a from ~a~%
eo: ni elektas ~a el ~a~%

source: ~A: package not found for version ~a~%
eo: ~A: pako ne trovita por versio ~a~%

source: ~A: unknown package~%
eo: ~A: nekonata pako~%

source: system locale lacks a definition
eo: sistema lokaĵaro malhavas difinon

source: failed to create GC root `~a': ~a~%
eo: fiasko dum kreo de radiko GC '~a': ~a~%

source: -L, --load-path=DIR prepend DIR to the package module search path
eo: -L, --load-path=UJO antaŭmedi UJOn al la modula serĉvojo de la pako

source: -K, --keep-failed keep build tree of failed builds
eo: -K, --keep-failed teni konstru-arbon el fiaskintaj konstruoj

source: -n, --dry-run do not build the derivations
eo: -n, --dry-run ne konstrui derivaĵojn

source: --fallback fall back to building when the substituter fails
eo: --fallback retropaŝi al konstruado kiam la anstataŭiganto fiaskas

source: --no-substitutes build instead of resorting to pre-built substitutes
eo: --no-substitutes konstrui anstataŭ uzi jam-konstruitajn anstataŭigantojn

source: --no-build-hook do not attempt to offload builds via the build hook
eo: --no-build-hook ne provi disŝarĝi konstruojn per la konstru-hoko

source: --max-silent-time=SECONDS mark the build as failed after SECONDS of silence
eo: --max-silent-time=SEKUNDOJ marki la konstruon kiel fiaskintan post SEKUNDOJ da silento

source: --timeout=SECONDS mark the build as failed after SECONDS of activity
eo: --timeout=SEKUNDOJ marki la konstruon kiel fiaskintan post SEKUNDOJ da aktivado

source: --verbosity=LEVEL use the given verbosity LEVEL
eo: --verbosity=NIVELO uzi la indikitan detaligan NIVELOn

source: -c, --cores=N allow the use of up to N CPU cores for the build
eo: -c, --cores=N permesigi uzon de ĝis N CPU-nukleojn por la konstruo

source: -M, --max-jobs=N allow at most N build jobs
eo: -M, --max-jobs=N permesi maksimume N konstru-taskojn

source: not a number: '~a' option argument: ~a~%
eo: ne estas numero: '~a' modifil-argumento: ~a~%

source: Usage: guix build [OPTION]... PACKAGE-OR-DERIVATION... Build the given PACKAGE-OR-DERIVATION and return their output paths.
eo: Uzado: guix build [MODIFILO]... PAKO-AŬ-DERIVAĴO... Konstrui la indikitan PAKO-AŬ-DERIVAĴOn kaj montri iliajn eligajn vojojn.

source: -e, --expression=EXPR build the package or derivation EXPR evaluates to
eo: -e, --expression=ESPR konstrui la pakon aŭ derivaĵon kiu rezultas de ESPR

source: -S, --source build the packages' source derivations
eo: -S, --source konstrui la font-derivaĵojn de la pakoj

source: -s, --system=SYSTEM attempt to build for SYSTEM--e.g., "i686-linux"
eo: -s, --system=SISTEMO provi konstrui por SISTEMO--ekz., "i686-linux"

source: --target=TRIPLET cross-build for TRIPLET--e.g., "armel-linux-gnu"
eo: --target=TRIOPO cruc-konstrui por TRIOPO--ekz., "armel-linux-gnu"

source: --with-source=SOURCE use SOURCE when building the corresponding package
eo: --with-source=FONTO uzi FONTOn dum konstruo de la koresponda pako

source: --no-grafts do not graft packages
eo: --no-grafts ne kunmetu pakojn

source: -d, --derivations return the derivation paths of the given packages
eo: -d, --derivations liveri la derivaĵajn vojojn de la indikitaj pakoj

source: -r, --root=FILE make FILE a symlink to the result, and register it as a garbage collector root
eo: -r, --root=DOSIERO igi DOSIEROn simbola ligo al la rezulto, kaj registri ĝin kiel radikon de rubaĵ-kolektanto

source: --log-file return the log file names for the given derivations
eo: --log-file liveri la protokol-dosierajn nomojn por la indikitaj derivaĵoj

source: -h, --help display this help and exit
eo: -h, --help montri ĉi tiun helpon kaj eliri

source: -V, --version display version information and exit
eo: -V, --version montri informon pri versio kaj eliri

source: sources do not match any package:~{ ~a~}~%
eo: fontoj ne kongruas al iu ajn pako:~{ ~a~}~%

source: ~A: unrecognized option~%
eo: ~A: nerekonata modifilo~%

source: no build log for '~a'~%
eo: neniu konstruita protokolo por '~a'~%

source: Usage: guix download [OPTION] URL Download the file at URL, add it to the store, and print its store path and the hash of its contents. Supported formats: 'nix-base32' (default), 'base32', and 'base16' ('hex' and 'hexadecimal' can be used as well).
eo: Uzmaniero: guix download [OPTION] URL Elŝuti la dosieron ĉe la URL, aldoni ĝin al la konservejo, kaj montri ĝian konservo-vojon kaj la haketon de ĝia enhavo. Subtenataj formoj: 'nix-base32' (aprioras), 'base32', kaj 'base16' ('hex' kaj 'hexadecimal' ankaŭ uzeblas, por deksesumo).

source: -f, --format=FMT write the hash in the given format
eo: -f, --format=FRM skribi la haketon laŭ la indikita formo

source: unsupported hash format: ~a~%
eo: nesubtenata haket-formo: ~a~%

source: ~a: failed to parse URI~%
eo: ~a: analizo de URI fiaskis~%

source: ~a: download failed~%
eo: ~a: elŝuto fiaskis~%

source: failed to build the empty profile~%
eo: fiasko dum konstruo de malplena profilo~%

source: switching from generation ~a to ~a~%
eo: alterno el generacio ~a al ~a~%

source: nothing to do: already at the empty profile~%
eo: nenio por fari: jam estas ĉe la malplena profilo~%

source: deleting ~a~%
eo: ni forigas ~a~%

source: package `~a' lacks output `~a'~%
eo: pako '~a' malhavas eligon '~a'~%

source: ~a: package not found~%
eo: ~a: pako ne trovita~%

source: The following environment variable definitions may be needed:~%
eo: La jenaj medi-variablaj difinoj povos esti necesaj:~%

source: Usage: guix package [OPTION]... PACKAGES... Install, remove, or upgrade PACKAGES in a single transaction.
eo: Uzmaniero: guix package [MODIFILO]... PAKOJ... Instalas, forigas, aŭ ĝisdatigas PAKOJn en ununura ago.

source: -i, --install=PACKAGE install PACKAGE
eo: -i, --install=PAKO instali PAKOn

source: -e, --install-from-expression=EXP install the package EXP evaluates to
eo: -e, --install-from-expression=ESP instali la pakon ESP rezultas al

source: -r, --remove=PACKAGE remove PACKAGE
eo: -r, --remove=PAKO forigi PAKOn

source: -u, --upgrade[=REGEXP] upgrade all the installed packages matching REGEXP
eo: -u, --upgrade[=REGESP] ĝisdatigi ĉiujn instalitajn pakojn kongruantajn al REGESP

source: --roll-back roll back to the previous generation
eo: --roll-back retropaŝi al la antaŭa generacio

source: --search-paths display needed environment variable definitions
eo: --search-paths montri necesajn medi-variablajn difinojn

source: -l, --list-generations[=PATTERN] list generations matching PATTERN
eo: -I, --list-generations[=ŜABLONO] listigi generaciojn kongruantajn al ŜABLONO

source: -d, --delete-generations[=PATTERN] delete generations matching PATTERN
eo: -d, --delete-generations[=ŜABLONO] forigi generaciojn kongruantajn al ŜABLONO

source: -S, --switch-generation=PATTERN switch to a generation matching PATTERN
eo: -S, --switch-generations=ŜABLONO ŝalti al generacio kongruanta al ŜABLONO

source: -p, --profile=PROFILE use PROFILE instead of the user's default profile
eo: -p, --profile=PROFILO uzi PROFILOn anstataŭ la apriora profilo de la uzanto

source: --bootstrap use the bootstrap Guile to build the profile
eo: --bootstrap uzi la praŝargilon Guile por konstrui la profilon

source: --verbose produce verbose output
eo: --verbose produkti detalplenan eligon

source: -s, --search=REGEXP search in synopsis and description using REGEXP
eo: -s, --search=REGESP serĉi en resumo kaj priskribo uzante REGESP

source: -I, --list-installed[=REGEXP] list installed packages matching REGEXP
eo: -I, --list-installed[=REGESP] listigi instalitajn pakojn kongruantajn al REGESP

source: -A, --list-available[=REGEXP] list available packages matching REGEXP
eo: -A, --list-available[=REGESP] listigi disponeblajn pakojn kongruantajn al REGESP

source: --show=PACKAGE show details about PACKAGE
eo: --show=PAKO montri detalojn pri PAKO

source: ~A: extraneous argument~%
eo: ~A: fremda argumento~%

source: Try "info '(guix) Invoking guix package'" for more information.~%
eo: Provu "info '(guix) Invoking guix package'" por pli da informo.'%

source: error: while creating directory `~a': ~a~%
eo: eraro: dum kreo de dosierujo '~a': ~a~%

source: Please create the `~a' directory, with you as the owner.~%
eo: Bonvolu krei la dosierujon '~a', kun vi kiel posedanto.~%

source: error: directory `~a' is not owned by you~%
eo: eraro: dosierujo '~a' ne estas posedata de vi~%

source: Please change the owner of `~a' to user ~s.~%
eo: Bonvole ŝanĝu la posedanton de '~a' al la uzanto ~s.~%

source: cannot switch to generation '~a'~%
eo: ne eblas ŝalti al generacio '~a'~%

source: invalid syntax: ~a~%
eo: malvalida sintakso: ~a~%

source: nothing to be done~%
eo: nenio por fari~%

source: ~a package in profile~%
eo: pako ~a en profilo~%

source: Generation ~a ~a
eo: Generacio ~a ~a

source: ~a (current)~%
eo: ~a (nuna)~%

source: Usage: guix gc [OPTION]... PATHS... Invoke the garbage collector.
eo: Uzmaniero: guix gc [MODIFILO]... VOJOJ... Voki la rubaĵ-kolektanton.

source: -C, --collect-garbage[=MIN] collect at least MIN bytes of garbage
eo: -C, --collect-garbage[=MIN] kolekti minimume MIN bajtojn da rubaĵo

source: -d, --delete attempt to delete PATHS
eo: -d, --delete provi forigi VOJOJn

source: --list-dead list dead paths
eo: --list-dead listigi mortajn vojojn

source: --list-live list live paths
eo: --list-live listigi aktivajn vojojn

source: --references list the references of PATHS
eo: --references listigi la referencojn de VOJOJ

source: -R, --requisites list the requisites of PATHS
eo: -R, --requisites listigi la antaŭbezonojn de VOJOJ

source: --referrers list the referrers of PATHS
eo: --referrers listigi la referencantojn de VOJOJ

source: invalid amount of storage: ~a~%
eo: malvalida kvanto da konserv-spaco: ~a~%

source: Usage: guix hash [OPTION] FILE Return the cryptographic hash of FILE. Supported formats: 'nix-base32' (default), 'base32', and 'base16' ('hex' and 'hexadecimal' can be used as well).
eo: Uzmaniero: guix hash [MODIFILO] DOSIERO Liveras la ĉifran haketon de DOSIERO. Subtenataj formoj: 'nix-base32' (aprioras), 'base32', kaj 'base16' ('hex' kaj 'hexadecimal' ankaŭ povas esti uzataj, por deksesumo).

source: -r, --recursive compute the hash on FILE recursively
eo: -r, --recursive komputi la haketon ĉe DOSIERO rikure

source: unrecognized option: ~a~%
eo: nerekonata modifilo: ~a~%

source: wrong number of arguments~%
eo: malĝusta nombro da argumentoj~%

source: Usage: guix pull [OPTION]... Download and deploy the latest version of Guix.
eo: Uzmaniero: guix pull [MODIFILO]... Elŝuti kaj liveri la lastan version de Guix.

source: --url=URL download the Guix tarball from URL
eo: --url=URL elŝuti la tar-dosiero de Guix el URL

source: --bootstrap use the bootstrap Guile to build the new Guix
eo: --bootstrap uzi 'bootstrap Guile' por konstrui novan Guix

source: tarball did not produce a single source directory
eo: tarball ne produktis ununuran fontan dosierujon

source: unpacking '~a'...~%
eo: malpakado de '~a'...~%

source: failed to unpack source code
eo: ni malsukcesis malpaki font-kodon

source: updated ~a successfully deployed under `~a'~%
eo: ni ĝisdatigis ~a sukcese, liverita sur '~a'~%

source: failed to update Guix, check the build log~%
eo: fiasko dum ĝisdatigo de Guix, kontrolu la konstru-protokolon~%

source: Guix already up to date
eo: Guix jam estas ĝisdata

source: ~A: unexpected argument~%
eo: ~A: neatendita argumento~%

source: failed to download up-to-date source, exiting
eo: fiasko dum elŝuto de aktuala fonto, ni ĉesas

source: authentication and authorization of substitutes disabled!~%
eo: aŭtentikigo kaj permeso de anstataŭantoj estas malebligataj!~%

source: download from '~a' failed: ~a, ~s~%
eo: elŝuto el '~a' fiaskis: ~a, ~s~%

source: while fetching ~a: server is somewhat slow~%
eo: dum havigo de ~a: servilo iom malrapidas~%

source: try `--no-substitutes' if the problem persists~%
eo: provu '--no-substituse' se la problemo persistos~%

source: updating list of substitutes from '~a'...~%
eo: ni ĝisdatigas liston de anstataŭigantoj el '~a'...~%

source: signature version must be a number: ~s~%
eo: subskriba versio devas esti numero: ~s~%

source: unsupported signature version: ~a~%
eo: nesubtenata subskriba versio: ~a~%

source: signature is not a valid s-expression: ~s~%
eo: subskribo ne estas valida s-esprimo: ~s~%

source: invalid format of the signature field: ~a~%
eo: malvalida formo de subskriba kampo: ~a~%

source: invalid signature for '~a'~%
eo: malvalida subskribo por '~a'~%

source: hash mismatch for '~a'~%
eo: haketa malkongruo por '~a'~%

source: '~a' is signed with an unauthorized key~%
eo: '~a' estas subskribita sen rajtigita ŝlosilo~%

source: signature on '~a' is corrupt~%
eo: subskribo en '~a' estas difektita~%

source: substitute at '~a' lacks a signature~%
eo: anstataŭigo ĉe '~a' malhavas subskribon~%

source: Downloading, please wait...~%
eo: Ni elŝutas, bonvolu atendi...~%

source: (Please consider upgrading Guile to get proper progress report.)~%
eo: (Bonvolu konsideri pri ĝisdatigo de Guile por havigi ĝustan progres-raporton.)~%

source: host name lookup error: ~a~%
eo: eraro en serĉado de gastigant-nomo: ~a~%

source: Usage: guix substitute-binary [OPTION]... Internal tool to substitute a pre-built binary to a local build.
eo: Uzmaniero: guix substitute-binary [MODIFILO]... Interna ilo por anstataŭigi antaŭ-konstruitan duumaĵon al loka kompilaĵo.

source: --query report on the availability of substitutes for the store file names passed on the standard input
eo: --query raporti pri la disponebleco de anstataŭigoj por la konservaj dosier-nomoj indikitaj per la ĉefenigujo

source: --substitute STORE-FILE DESTINATION download STORE-FILE and store it as a Nar in file DESTINATION
eo: --substitute KONSERV-DOSIERO CELO elŝuti KONSERV-DOSIEROn kaj konservi ĝin kiel Nar en la dosiero CELO

source: ACL for archive imports seems to be uninitialized, substitutes may be unavailable
eo: ACL por importo de arĥivoj ŝajnas esti ne-ekigita, anstataŭoj eble ne disponeblos

source: these substitute URLs will not be used:~{ ~a~}~%
eo: tiuj ĉi anstataŭigaj URL-oj ne estos uzataj:~{ ~a~}~%

source: failed to look up host '~a' (~a), substituter disabled~%
eo: ni malsukcesis serĉi gastiganton '~a' (~a), anstataŭiganto estas malebligata~%

source: ~a: unrecognized options~%
eo: ~a: nerekonata modifiloj~%

source: cannot find public key for secret key '~a'~%
eo: ne eblas trovi publikan ŝlosilon por la sekreta '~a'~%

source: error: invalid signature: ~a~%
eo: eraro: malvalida subskribo: ~a~%

source: error: unauthorized public key: ~a~%
eo: eraro: nerajtigita publika ŝlosilo: ~a~%

source: error: corrupt signature data: ~a~%
eo: eraro: difektita subskriba datumaro: ~a~%

source: Usage: guix authenticate OPTION... Sign or verify the signature on the given file. This tool is meant to be used internally by 'guix-daemon'.
eo: Uzmaniero: guix authenticate MODIFILO... Subskribi aŭ kontroli la subskribon de indikita dosiero. Tiu ĉi ilo celas esti interne uzata de 'guix-daemon'.

source: wrong arguments
eo: malĝustaj argumentoj

source: failed to open operating system file '~a': ~a~%
eo: fiasko dum malfermo de la operaci-sistema dosiero '~a': ~a~%

source: ~a: error: ~a~%
eo: ~a: eraro: ~a~%

source: failed to load operating system file '~a':~%
eo: fiasko dum ŝargo je operaci-sistema dosiero '~a':~%

source: failed to register '~a' under '~a'~%
eo: fiasko dum registro de '~a' sub '~a'~%

source: failed to install GRUB on device '~a'~%
eo: fiasko dum instalo de GRUB en la aparato '~a'~%

source: initializing the current root file system~%
eo: ekigado de la nuna radika dosiersistemo~%

source: activating system...~%
eo: ni aktivas la sistemon...~%

source: unrecognized boot parameters for '~a'~%
eo: nerekonataj ekŝargaj parametroj por '~a'~%

source: initializing operating system under '~a'...~%
eo: ni ekigas la operaci-sistemon sub '~a'...~%

source: Usage: guix system [OPTION] ACTION FILE Build the operating system declared in FILE according to ACTION.
eo: Uzmaniero: guix system [MODIFILO] AGO DOSIERO Konstrui la operaci-sistemon deklarita en DOSIERO akorde al AGO.

source: The valid values for ACTION are:
eo: La validaj valoroj por AGO estas:

source: - 'reconfigure', switch to a new operating system configuration
eo: - 'reconfigure', alterni al nova operaci-sistema agordaro

source: - 'build', build the operating system without installing anything
eo: - 'build', konstrui la operaci-sistemon sen instali ion ajn

source: - 'vm', build a virtual machine image that shares the host's store
eo: - 'vm', konstrui virtual-maŝinan bildon kiu kundividas la gastigantan memoron

source: - 'vm-image', build a freestanding virtual machine image
eo: - 'vm-image', konstrui memstaran virtual-maŝinan bildon

source: - 'disk-image', build a disk image, suitable for a USB stick
eo: - 'disk-image', konstrui disk-bildon, taŭga por USB-memoro

source: - 'init', initialize a root file system to run GNU.
eo: - 'init', ekigi radikan dosiersistemon por lanĉi GNU-on.

source: --image-size=SIZE for 'vm-image', produce an image of SIZE
eo: --image-size=GRANDO por 'vm-image', produkti bildon je GRANDO

source: --no-grub for 'init', do not install GRUB
eo: --no-grub por 'init', ne instali GRUB

source: --share=SPEC for 'vm', share host file system according to SPEC
eo: --share=SPEC por 'vm', kundividi gastigan dosiersistemon akorde al SPEC

source: --expose=SPEC for 'vm', expose host file system according to SPEC
eo: --expose=SPEC for 'vm', elmontri gastigan dosiersistemon akorde al SPEC

source: --full-boot for 'vm', make a full boot sequence
eo: --full-boot por 'vm', fari kompletan ekŝargan sekvon

source: ~a: unknown action~%
eo: ~a: nekonata pako~%

source: wrong number of arguments for action '~a'~%
eo: malĝusta nombro da argumentoj por la ago '~a'~%

source: no configuration file specified~%
eo: neniu agorda dosiero estis indikata~%

source: Available checkers:~%
eo: Disponeblaj kontroliloj:~%

source: description should not be empty
eo: priskribo ne devos esti malplena

source: description should start with an upper-case letter or digit
eo: priskribo devos komenci per majuskla litero aŭ cifero

source: sentences in description should be followed ~ by two spaces; possible infraction~p at ~{~a~^, ~}
eo: frazoj en la priskribo devos esti sekvataj de ~ du spacoj; ebla malobeo~p ĉe ~{~a~^, ~}

source: pkg-config should probably be a native input
eo: pkg-config probable devos esti originala enigo

source: synopsis should not be empty
eo: resumo ne devos esti malplena

source: no period allowed at the end of the synopsis
eo: punkto ne estas permesata ĉe la fino de la resumo

source: no article allowed at the beginning of the synopsis
eo: artikolo ne estas permesata ĉe komenco de la resumo

source: synopsis should be less than 80 characters long
eo: resumo devos havi malpli ol 80 signoj

source: synopsis should start with an upper-case letter or digit
eo: resumo devos komenci per majuskla litero aŭ cifero

source: synopsis should not start with the package name
eo: resumo ne devos komenci per la pak-nomo

source: URI ~a not reachable: ~a (~s)
eo: URI ~a ne estas alirebla: ~a (~s)

source: URI ~a domain not found: ~a
eo: URI ~a domajno ne trovita: ~a

source: URI ~a unreachable: ~a
eo: URI ~a nealirebla: ~a

source: invalid value for home page
eo: malvalida valoroj por hejmpaĝo

source: invalid home page URL: ~s
eo: malvalida hejmpaĝa URL: ~s

source: file names of patches should start with the package name
eo: dosiernomoj de flikaĵoj devos komenci per la pak-nomo

source: ~a: ~a: proposed synopsis: ~s~%
eo: ~a: ~a: proponita resumo: ~s~%

source: ~a: ~a: proposed description:~% "~a"~%
eo: ~a: ~a: proponita priskribo:~% "~a"~%

source: Validate package descriptions
eo: Validigi pak-priskribojn

source: Validate synopsis & description of GNU packages
eo: Validigi resumon kaj priskribon de GNU-pakoj

source: Identify inputs that should be native inputs
eo: Identigi enigojn kiuj devus esti originalaj enigoj

source: Validate file names of patches
eo: Validigi dosiernomojn de flikaĵoj

source: Validate home-page URLs
eo: Validigi heimpaĝajn URL

source: Validate source URLs
eo: Validigi fontajn URL

source: Validate package synopses
eo: Validigi pak-resumojn

source: Usage: guix lint [OPTION]... [PACKAGE]... Run a set of checkers on the specified package; if none is specified, run the checkers on all packages.
eo: Uzmaniero: guix lint [MODIFILO]... [PAKO]... Lanĉi aron da kontroliloj por la indikita pako; se neniu estas indikita, lanĉi la konstrolilojn por ĉiuj pakoj.

source: -c, --checkers=CHECKER1,CHECKER2... only run the specificed checkers
eo: -c, --checkers=KONTROL1,KONTROL2... nur lanĉi la indikitajn kontrolilojn

source: -l, --list-checkers display the list of available lint checkers
eo: -l, --list-checkers montri la liston de disponeblaj kontroliloj

source: ~a: invalid checker~%
eo: ~a: malvalida kontrolilo~%

source: signature verification failed for `~a'~%
eo: subskriba kontrolo fiaskis por '~a'~%

source: (could be because the public key is not in your keyring)~%
eo: (eble ĉar la publika ŝlosilo ne estas en via ŝlosilringo)~%

source: ~a: could not locate source file
eo: ~a: ne eblis trovi fontan dosieron

source: ~a: ~a: no `version' field in source; skipping~%
eo: ~a: ~a: neniu kampo 'version' en la fonto; ni saltas~%

source: failed to install locale: ~a~%
eo: fiasko dum instalo de lokaĵaro: ~a~%

source: Copyright (C) 2014 the Guix authors License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html> This is free software: you are free to change and redistribute it. There is NO WARRANTY, to the extent permitted by law.
eo: Kopirajto (C) 2014 la aŭtoroj de Guix Permeso GPLv3+: GNU GPL versio 3 aŭ posta <http://gnu.org/licenses/gpl.html> Tio ĉi estas libera programaro: vi estas libera por modifi kaj redisdoni ĝin. Estas NENIU GARANTIO, plejamplekse permesate de leĝoj.

source: Report bugs to: ~a.
eo: Raportu program-misojn al: ~a.

source: ~a home page: <~a>
eo: hejm-paĝo de ~a: <~a>

source: General help using GNU software: <http://www.gnu.org/gethelp/>
eo: Ĝenerala helpo por uzi programaron de GNU: <http://www.gnu.org/gethelp/>

source: ~a: invalid number~%
eo: ~a: malvalida numero~%

source: invalid number: ~a~%
eo: malvalida numero: ~a~%

source: unknown unit: ~a~%
eo: nekonata unuo: ~a~%

source: ~a:~a:~a: package `~a' has an invalid input: ~s~%
eo: ~a:~a:~a: pako '~a' havas malvalidan enigon: ~s~%

source: ~a: ~a: build system `~a' does not support cross builds~%
eo: ~a: ~a: konstrui sistemon '~a' ne subtenas crucajn konstruojn~%

source: profile '~a' does not exist~%
eo: profilo '~a' ne ekzistas~%

source: generation ~a of profile '~a' does not exist~%
eo: generacio ~a de la profilo '~a' ne ekzistas~%

source: failed to connect to `~a': ~a~%
eo: fiasko dum konekto al '~a': ~a~%

source: build failed: ~a~%
eo: konstruo fiakis: ~a~%

source: reference to invalid output '~a' of derivation '~a'~%
eo: referenco al malvalida eligo '~a' de la derivaĵo '~a'~%

source: failed to read expression ~s: ~s~%
eo: fiasko dum lego de esprimo ~s: ~s~%

source: failed to evaluate expression `~a': ~s~%
eo: fiasko dum analizo de esprimo '~a': ~a~%

source: expression ~s does not evaluate to a package~%
eo: la esprimo ~s ne rezultas pakon~%
