Repository: 0x2b3bfa0/guix
Catalog: po/guix/*.po
Languages: eo

source: ~:[The following derivation would be built:~%~{ ~a~%~}~;~]
eo: ~:[La jena derivo estus konstruata:~%~{ ~a~%~}~;~]

source: ~:[The following file would be downloaded:~%~{ ~a~%~}~;~]
eo: ~:[La jena derivo estus elŝutata:~%~{ ~a~%~}~;~]

source: ~:[The following derivation will be built:~%~{ ~a~%~}~;~]
eo: ~:[La jena derivo estos konstruata:~%~{ ~a~%~}~;~]

source: ~:[The following file will be downloaded:~%~{ ~a~%~}~;~]
eo: ~:[La jena derivo estos elŝutata:~%~{ ~a~%~}~;~]

source: The following package would be removed:~%~{~a~%~}~%
eo: La jena pako estus forigata:~%~{~a~%~}~%

source: The following package will be removed:~%~{~a~%~}~%
eo: La jena pako estos forigata:~%~{~a~%~}~%

source: The following package would be upgraded:~%~{~a~%~}~%
eo: La jena pako estus ĝisdatigata:~%~{~a~%~}~%

source: The following package will be upgraded:~%~{~a~%~}~%
eo: La jena pako estos ĝisdatigata:~%~{~a~%~}~%

source: The following package would be installed:~%~{~a~%~}~%
eo: La jena pako estus instalata:~% ~{~a~%~}~%

source: The following package will be installed:~%~{~a~%~}~%
eo: La jena pako estos instalata:~% ~{~a~%~}~%

source: <unknown location>
eo: <nekonata loko>

source: failed to create configuration directory `~a': ~a~%
eo: fiasko dum kreo de agorda dosierujo '~a': ~a~%

source: unknown
eo: nekonata

source: invalid argument: ~a~%
eo: malvalida argumento: ~a~%

source: Try `guix --help' for more information.~%
eo: Provu 'guix --help' por pli da informo.~%

source: Usage: guix COMMAND ARGS... Run COMMAND with ARGS.
eo: Uzmaniero: guix KOMANDO ARGj... Lanĉas KOMANDOn kun ARGj.

source: COMMAND must be one of the sub-commands listed below:
eo: KOMANDO devas esti unu el la sub-komandoj sube listataj:

source: guix: ~a: command not found~%
eo: guix: ~a: komando ne trovita~%

source: guix: missing command name~%
eo: guix: mankas komanda nomo~%

source: guix: unrecognized option '~a'~%
eo: guix: nerekonata modifilo: '~a'~%

source: using Guile ~a, which does not support ~s encoding~%
eo: ni uzas Guile ~a, kiu ne subtenas enkodigon ~s~%

source: download failed; use a newer Guile~%
eo: elŝuto fiaskis; uzu pli novan Guile~%

source: following redirection to `~a'...~%
eo: ni sekvas la redirektigon al '~a'...~%

source: download failed
eo: elŝuto fiaskis

source: signature is not a valid s-expression
eo: subskribo ne estas valida s-esprimo

source: invalid signature
eo: nevalida subskribo

source: invalid hash
eo: nevalida haketo

source: unauthorized public key
eo: nerajtigita publika ŝlosilo

source: corrupt signature data
eo: difektita subskriba datumaro

source: corrupt file set archive
eo: difektita arĥivo de dosier-grupo

source: importing file or directory '~a'...~%
eo: ni importas dosieron aŭ dosierujon '~a'...~%

source: found valid signature for '~a'~%
eo: ni trovis validan subskribon por '~a'~%

source: imported file lacks a signature
eo: importita dosiero malhavas subskribon

source: invalid inter-file archive mark
eo: malvalida inter-dosiera arĥiva marko
